
#  Performing a semi join

##  Assignment 

Some of the tracks that have generated the most significant amount of revenue are from TV-shows or are other non-musical audio. You have been given a table of invoices that include top revenue-generating items. Additionally, you have a table of non-musical tracks from the streaming service. In this exercise, you'll use a semi join to find the top revenue-generating non-musical tracks..

The tables `non_mus_tcks`, `top_invoices`, and `genres` have been loaded for you.

##  Pre exercise code 

```
from pickle import load
import urllib.request
import pandas as pd

fn_gen = 'https://assets.datacamp.com/production/repositories/5486/datasets/9640e90a0bc94f8937c99622fda9749450755dfa/genres.p'
fn_non = 'https://assets.datacamp.com/production/repositories/5486/datasets/5c83e75cffe052226b6ffd6b094ca072d232f8e1/non_music_t.p'
fn_inv = 'https://assets.datacamp.com/production/repositories/5486/datasets/8e1ef042cba059f5bda4eba8a3f1c92c321b7098/top_invoices.p'

genres = load(urllib.request.urlopen(fn_gen))
non_mus_tcks = load(urllib.request.urlopen(fn_non))
top_invoices = load(urllib.request.urlopen(fn_inv))
```



##  Instructions 

- Merge `non_mus_tcks` and `top_invoices` on `tid` using an inner join. Save the result as `tracks_invoices`.
- Use `.isin()` to subset the rows of `non_mus_tck` where `tid` is in the `tid` column of  `tracks_invoices`. Save the result as `top_tracks`.
- Group `top_tracks` by `gid` and count the `tid` rows. Save the result to `cnt_by_gid`.
- Merge `cnt_by_gid` with the `genres` table on `gid` and print the result.

In [18]:
from pickle import load
import urllib.request
import pandas as pd

In [19]:
fn_gen = 'https://assets.datacamp.com/production/repositories/5486/datasets/9640e90a0bc94f8937c99622fda9749450755dfa/genres.p'
fn_non = 'https://assets.datacamp.com/production/repositories/5486/datasets/5c83e75cffe052226b6ffd6b094ca072d232f8e1/non_music_t.p'
fn_inv = 'https://assets.datacamp.com/production/repositories/5486/datasets/8e1ef042cba059f5bda4eba8a3f1c92c321b7098/top_invoices.p'

In [22]:
genres = load(urllib.request.urlopen(fn_gen))
non_mus_tcks = pd.read_pickle("non_music_t.p")
top_invoices = pd.read_pickle("top_invoices.p")

In [24]:
genres.head(1)

   gid  name
0    1  Rock

In [25]:
non_mus_tcks.head(1)

       tid                    name  aid  mtid  gid  u_price
2819  2820  Occupation / Precipice  227     3   19     1.99

In [26]:
top_invoices.head(1)

     ilid  iid   tid  uprice  quantity
469   470   88  2832    1.99         1

In [23]:
tracks_invoices = non_mus_tcks.merge(top_invoices, on="tid")

In [27]:
tracks_invoices.head()

    tid       name  aid  mtid  gid  u_price  ilid  iid  uprice  quantity
0  2850    The Fix  228     3   21     1.99   473   88    1.99         1
1  2850    The Fix  228     3   21     1.99  2192  404    1.99         1
2  2868  Walkabout  230     3   19     1.99   476   88    1.99         1
3  2868  Walkabout  230     3   19     1.99  2194  404    1.99         1
4  3177   Hot Girl  249     3   19     1.99  1668  306    1.99         1

In [29]:
top_tracks = non_mus_tcks[non_mus_tcks["tid"].isin(tracks_invoices["tid"])]

In [30]:
top_tracks

       tid                          name  aid  mtid  gid  u_price
2849  2850                       The Fix  228     3   21     1.99
2867  2868                     Walkabout  230     3   19     1.99
3176  3177                      Hot Girl  249     3   19     1.99
3199  3200                Gay Witch Hunt  251     3   19     1.99
3213  3214             Phyllis's Wedding  251     3   22     1.99
3222  3223  How to Stop an Exploding Man  228     3   21     1.99
3249  3250                         Pilot  254     3   19     1.99

In [31]:
cnt_by_gid = top_tracks.groupby("gid").agg({"tid":"count"})

In [32]:
cnt_by_gid

     tid
gid
19     4
21     2
22     1

In [33]:
cnt_by_gid.merge(genres, on="gid")

   gid  tid      name
0   19    4  TV Shows
1   21    2     Drama
2   22    1    Comedy